HELYXcore-4.4.0/examples/legacy/multiphase/reactingTwoPhaseEulerFoam/RAS/bubbleColumnEvaporatingReacting/constant/chemistryProperties.gas
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    solver            EulerImplicit;
}

chemistry           on;

initialChemicalTimeStep 1e-07;

EulerImplicitCoeffs
{
    cTauChem        1;
}

odeCoeffs
{
    solver          Rosenbrock43;
    absTol          1e-8;
    relTol          0.01;
}

reactions
{
    waterGasShift
    {
        type        reversibleArrheniusReaction;

        reaction    "CO^0.93 + H2O^0.24 = CO2^0.69 + H2^1";

        A           1e8;
        beta        0.86;
        Ta          1e4;
    }
}

// ************************************************************************* //
