HELYXcore-4.4.0/examples/legacy/multiphase/reactingTwoPhaseEulerFoam/RAS/bubbleColumnEvaporatingReacting/constant/thermophysicalProperties.liquid
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          eConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

species ( AIR H2O );

defaultSpecie H2O;

"(mixture|H2O)"
{
    specie
    {
        molWeight       18.0153;
    }
    equationOfState
    {
        rho         1000;
    }
    thermodynamics
    {
        Hf          -1.5879e+07;
        Cv          4195;
    }
    transport
    {
        mu          3.645e-4;
        Pr          2.289;
    }
}

AIR
{
    specie
    {
        molWeight   28.9;
    }
    equationOfState
    {
        rho         1000;
    }
    thermodynamics
    {
        Hf          0;
        Cv          4195;
    }
    transport
    {
        mu          3.645e-4;
        Pr          2.289;
    }
}


// ************************************************************************* //
